#include<stdio.h>
int main(int argc, char * argv[]) 
{
    char ch = 'A';//-128 ~ 127
    int i = 65;//-2 147 483 648 ~ +2 147 483 647
    unsigned int f = 33554433;//0 ~ 4 294 967 295
    *(int *)&f >>= 24;//f补码右移24位
    //  *(int*)&f=f （想当于取f的地址让其强行转换为指针并指向它自己）
    *(int *)&f = *(int *)&f + '?';//做运算时先把'?'转换为整形再相加
    printf("ch = %c  i = %c  f = %c\n", ch, i, *(int *)&f);//最后再转换为char类型输出
    return 0;
}//ch = A  i = A  f = A
/*
关于运算中的类型转换有两个通用的指导原则：
1.为了防止数据精度损失，如果有必要的话，类型总是被提升为较宽的类型
2.所有含有小于整数类型的算术表达式在计算之前其类型被提升为整形数据类型
*/